In [1]:
import numpy as np
import pandas as pd

### 데이터프레임 구조 정보 확인
- DataFrame이나 Series가 생성되었다면 데이터는 구조적인 문제는 없음.
- 구조정보를 확인한다는 의미는 데이터 구조에 대한 정보를 확인한다는 의미
- 결측치 : 측정이 결여된 값, 측정되지 않은 데이터, 파일에는 빈칸으로 되었고 DataFrame이나 Series는 Na, NaN, NaT등으로 표시됨.
- 이상치 : 정상이 아닌 데이터. 이상치 확인을 위해서 반드시 데이터 명세서가 필요함.
- 문자열 데이터 존재 여부 확인: 머신러닝, 딥러닝 알고리즘은 수치 데이터를 학습하기 때문에 문자열 데이터 존재 여부를 확인해야 함.

In [2]:
df1 = pd.read_csv('data/train.csv')
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
# 컬럼 하나를 추출해서 담아준다.
s1 = df1['Embarked']
s1

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [4]:
# 행과 컬럼의 수를 확인
rows, cols = df1.shape

print(f'행 : {rows}')
print(f'열 : {cols}')

행 : 891
열 : 12

In [5]:
# Series의 경우 행의 개수만 튜플에 담겨져서 넘겨줌
a1 = s1.shape

print(f'행 : {a1[0]}')

행 : 891

In [6]:
# 데이터프레임의 컬럼과 인덱스
columns = df1.columns
index = df1.index

display(columns)
display(index)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

RangeIndex(start=0, stop=891, step=1)

In [7]:
# Series의 index
s1.index

RangeIndex(start=0, stop=891, step=1)

In [8]:
# 데이터프레임의 요약정보
# 891 entries: 행의 개수
# total 12 columns: 컬럼의 개수
# 데이터프레임.shape를 통해서도 동일한 정보를 확인할 수 있다.
# Column: 컬럼 이름 목록, 데이터프레임.columns를 통해서도 확인할 수 있다.
# Non-Null Count: 결측치를 제외한 데이터의 개수, 각 컬럼별 결측치의 개수를
# 구할 수 있기 때문에 여기서 확인하는 것은 추천하지 않는다.

# Dtype: 각 컬럼별 데이터 타입
# int- 정수, float-실수, object-문자열, datetime-날짜 시간
# 머신러닝, 딥러닝 프로젝트를 수행할 때는 문자열을 숫자로 바꾸는 작업을 헤줘야 함.
# 따라서 Dtype이 object컬람에 대해 숫자로 변환하는 작업을 해야함.
# 날짜 타압의 데이터가 있으면 시계열(시간의 흐름에 따른 변화) 분석이 가능하고
# RNN, LSTM등을 이용해 과거의 시간 흐름에 따른 데이터 변화 패턴을 학습사켜
# 미래의 데이터변화 패천을 예측하는 프로젝트를 수행할 수 있음.
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
# 각 컬럼별 결측치 확인
# isna(): 데이터프레임의 모든 데이터를 살펴보고 결측치는 True, 정상데이터는 False로 되어 있는 데이터프레임 생성
# sum(): 각 컬럼별 총합을 구함.
# True, False로 구성된 컬럼의 경우 True => 1, False => 0로 취급하여 확인 가능
df1.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
# 각 컬렴별 결측치 비율
df1.isna().sum() / df1.shape[0] * 100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

### 데이터의 종류
- 범주형, 카테고리형, 레이블형 등등: 값의 종류가 정해져 있는 값(혈액형, 성별, 지하철 노선 번호 등등)
- 범위형: 범위가 있거나 범주형이 아닌 데이터(나이, 키, 몸무게, 코스피지수, 온도 등)

In [11]:
# 요약 통계 정보
# 데이터프레임 내의 숫자 타입 컬럼만 모아서 요약 통계 정보를 보여줌
df1.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [12]:
# describe 함수를 그냥 사용하면 카테고리형 컬럼도 범위형 컬럼이라고 생각하고 보여줌
# 이에 범위형 데이터를 가지고 있는 컬럼만 사용해야 함

# min과 max를 확인하여 컬럼의 값들이 정상 범위안에 있는지 확인함
df1[['Age', 'Fare']].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [16]:
# 카테고리형 데이터의 이상치 확인은 다음과 같이 함.
# value_counts: 어떠한 값이 몇 개씩 지정되어 있는가?

a1 = df1['Pclass'].value_counts().index
a2 = df1['Embarked'].value_counts().index

display(a1)
display(a2)

Int64Index([3, 1, 2], dtype='int64')

Index(['S', 'C', 'Q'], dtype='object')